{
    "products": [
      {
        "id": 1,
        "title": "Titan X1 Pro",
        "description": "Computador de alto desempenho com processador Intel Core i9, 32GB de RAM e SSD de 1TB. Ideal para jogos pesados, edição de vídeos e tarefas profissionais que exigem muita performance. Equipado com placa de vídeo RTX 4070 para gráficos incríveis",
        "price": 7500.00,
        "launch": true,
        "promotion": false,
        "image": "/images/launch/titan-x1-pro.png",
        "rating": 4.5,
        "stock": 10
      },
      {
        "id": 2,
        "title": "ComBook Ultra 14",
        "description": "Computador leve e moderno com tela Full HD de 14, processador intel Core i5, 8BG de RAM e SSD de 512GB.Perfeito para trabalho,estudos e uso diário com ótima portabilidade e bateria duratoura",
        "price": 3000.00,
        "launch": true,
        "promotion": true,
        "image": "/images/launch/comBook-ultra-14.png",
        "rating": 4.7,
        "stock": 20
      },
      {
        "id": 3,
        "title": "Smartwatch Samsung Galaxy Watch 5",
        "description": "O smartwatch que oferece o mais completo conjunto de funções de monitoramento para o acompanhamento da Saúde e do Bem-Estar de uma maneira precisa e confiável. Possui os recursos essenciais e mais avançados para medir e acompanhar o estado da sua Saúde, funções como monitor de Batimento Cardíaco, Pressão Arterial, Eletrocardiograma, Oxímetro, Detecção de Queda e Chamada de Emergência, programa de Coaching do Sono para monitorar e melhorar a qualidade do seu Sono. ",
        "price": 1139.00,
        "launch": false,
        "promotion": true,
        "image": "/images/launch/smartwatch-samsung-galaxy-watch-5.png",
        "rating": 4.0,
        "stock": 5
      },
      {
        "id": 4,
        "title": "CyberStation GXT ",
        "description": "PC gamer com AMD Ryzen 7, 16GB de RAM, SSD de 500GB e HD de 1TB. Conta com placa de vídeo Radeon RX 6800 XT, ideal para jogos exigentes e gráficos em alta qualidade. Design robusto com LED RGB.",
        "price": 2500.00,
        "launch": true,
        "promotion": false,
        "image": "/images/launch/cyberStation-gxt.png",
        "rating": 4.3,
        "stock": 8
      }, {
        "id": 5,
        "title": "Infinity All-in-One 27",
        "description": "Tudo em um só aparelho! Tela de 27 com imagem nítida, processador Intel Core i7, 16GB de RAM e SSD de 1TB. Excelente para home office e uso profissional, com webcam integrada e ótimo som.",
        "price": 2500.00,
        "launch": false,
        "promotion": true,
        "image": "/images/launch/infinity-all-in-one-27.png",
        "rating": 4.3,
        "stock": 8
      },
      {
        "id": 6,
        "title": "Airpods Apple, com Estojo de Recarga",
        "description": "Airpods Apple, com Estojo de Recarga, Bluetooth, Branco\nO Novo AirPods traz uma experiência nova em usar fones de ouvido sem fio. É só tirá-los do estojo e estão prontos para uso com seu iPhone, Apple Watch, iPad ou Mac. Ele oferece cinco horas de som e três horas para conversar com apenas uma carga. Eles acompanham seu ritmo graças ao estojo que proporciona várias cargas adicionais para mais de 24 horas de uso.",
        "price": 120.00,
        "launch": true,
        "promotion": false,
        "image": "/images/launch/airpods-apple.png",
        "rating": 4.3,
        "stock": 8
      },
      {
        "id": 7,
        "title": "Teclado Mecânico Gamer HyperX Alloy",
        "description": "Teclado HyperX Alloy MKW100, HKBM1-R-EUA/G - 4P5E1AA#ABA\nObtenha uma iluminação radiante e por tecla com efeitos dinâmicos para adicionar um toque de estilo ao seu setup de PC. Estrutura em alumínio durável\nCom uma estrutura de alumínio sólida, o Alloy MKW100 foi projetado para fornecer estabilidade quando os toques em teclas estiverem a todo vapor. O descanso para pulso removível ajuda a reduzir a fadiga de longas sessões de jogos ou de trabalho.",
        "price": 199.99,
        "launch": false,
        "promotion": true,
        "image": "/images/launch/teclado-mecanico-gamer.png",
        "rating": 4.3,
        "stock": 8
      },
      {
        "id": 8,
        "title": "Monitor Gamer Husky Tempest 34",
        "description": "O Monitor Gamer Husky Gaming Tempest LED 34 UltraWide Curvo traz a experiência de imersão completa para o seus jogos! A tela Curva UltraWide, formato 21:9, e Quad HD (QHD), com taxa de atualização de 144Hz, confere maior campo de visão e amplifica a experiência de imersão durante seus jogos.",
        "price": 2099.99,
        "launch": true,
        "promotion": false,
        "image": "/images/launch/monitor-gamer-husky.png",
        "rating": 4.3,
        "stock": 8
      },
      {
        "id": 9,
        "title": "Soundbar LG SNH5, 4.1 Canais, Bluetooth",
        "description": "O LG Sound Bar SNH5 uniu-se ao DTS Virtual:X para transformar sua casa em um verdadeiro cinema e deixar a exibição dos seus filmes favoritos muito mais imersiva. O LG Sound Bar SNH5 suporta saída para 4.1 canais para que você possa assistir à TV com um som mais envolvente.",
        "price": 2099.99,
        "launch": true,
        "promotion": false,
        "image": "/images/launch/soundbar-lg-snh5.png",
        "rating": 4.3,
        "stock": 8
      }
    ]
  }
  